tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "stripe/stripe-cli"

cask_args appdir: "~/Applications"

cask "capcut"
cask "discord"
cask "firefox"
cask "google-chrome"
cask "google-drive"
cask "iterm2"
cask "jetbrains-toolbox"
cask "obsidian"
cask "raycast"
cask "spotify"
cask "signal"
cask "slack"
cask "telegram"

brew "asdf"
brew "autoconf"
brew "automake"
brew "bash"
brew "bat"
brew "bottom"
brew "coreutils"
brew "direnv"
brew "ffmpeg"
brew "giflib"
brew "libpng"
brew "libpq"
brew "pkg-config"
brew "htop"
brew "hub"
brew "imagemagick"
brew "jpeg", link: true
brew "jq"
brew "llvm"
brew "lsd"
brew "macvim"
brew "mas"
brew "neovim"
brew "ollama"
brew "overmind"
brew "pipx"
brew "postgresql@15"
brew "ruby-build"
brew "rbenv"
brew "redis"
brew "stow"
brew "telnet"
brew "tldr"
brew "tree"
brew "z"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "stripe/stripe-cli/stripe"
cask "1password-cli"
cask "docker", args: { appdir: "/Applications" }
cask "fig"
cask "jetbrains-toolbox"
cask "1password"
cask "dropbox"
cask "rectangle"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
mas "Be Focused", id: 973134470
